Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/R09B.tmx
Source language: en_us
Languages: zh_cn

source: The Hero
zh_cn: 英雄

source: My mother's parents came from Hungary, but my grandfather was educated in Germany.
zh_cn: 我外公外婆都是匈牙利人，外公在德国受的教育。

source: Even though Hungarian was his native language, he preferred German to all the other languages he spoke. It seems he was able to hold a conversation in nine languages, but was most comfortable in German.
zh_cn: 匈牙利语是他们本族语言，外公能说九种语言，在所有会说的语言中他最喜欢德语，最擅长的也是德语。

source: Every morning, before going to his office, he read the German language newspaper, which was American owned and published in New York.
zh_cn: 每天早晨上班前，他总要读一阵子美国人在纽约出版的德语报纸。

source: My grandfather was the only one in his family to come to the United States. He still had relatives living in Europe.
zh_cn: 外公仅是家族中唯一举家迁居美国的，他仍有许多亲戚在欧洲。

source: When the first World War broke out, he lamented the fact that if my uncle, his only son had to go, it would be cousin fighting against cousin.
zh_cn: 在第一次世界大战爆发期间，他抱怨道，假如他唯一的儿子，也就是我舅舅参战，就意味着堂表兄弟之间要进行一番激烈战斗。

source: In the early days of the war, my grandmother implored him to stop taking the German newspaper and to take an English language paper, instead.
zh_cn: 战争前期，我外婆哀求外公不要看德语报纸，改看英语的。

source: He scoffed at the idea, explaining that the fact that it was in German did not make it a German newspaper, but only an American newspaper, printed in German.
zh_cn: 外公认为这种想法荒唐可笑，对她解释说，事实上不只是德国有德语报纸，美国报纸也有德语的。

source: But my grandmother insisted, if only that the neighbors not see him read it and think he was German.
zh_cn: 不过外婆坚持认为，他看德语报纸，若邻居看到肯定会说他是德国人。

source: So, under duress, he finally gave up the German newspaper.
zh_cn: 外公迫于压力最终还是放弃了德语报。

source: One day, the inevitable happened and my Uncle Milton received his draft notice.
zh_cn: 终于有一天，发生了一起不可避免的事情，舅舅米尔顿收到一份征兵入伍通知。

source: My Grandparents were very upset, but my mother, his little sister was ecstatic.
zh_cn: 外公非常不安，但我的妈妈，也就是我舅舅的妹妹，却相当兴奋。

source: Now she could brag about her soldier brother going off to war.
zh_cn: 她可以骄傲地夸她有一个哥哥奔赴战场了。

source: She was ten years old and my uncle, realizing how he was regarded by his little sister and all of her friends, went out and bought them all service pins, which meant that they had a loved one in the service.
zh_cn: 我妈那时只有10岁，舅舅得到小妹和小妹朋友爱戴非常高兴，于是买了胸针发夹分发给大家，表示她们有亲人在部队中服役。

source: All the little girls were delighted. When the day came for him to leave, his whole regiment, in their uniforms, left together from the same train station. There was a band playing and my mother and her friends came to see him off. Each one wore her service pin and waved a small American flag, cheering the boys, as they left.The moment came and the soldiers, all rookies, none of whom had had any training, but who had nevertheless all been issued, uniforms, boarded the train.
zh_cn: 舅舅出发的那天，我妈和她的女友兴高采烈前去送行，每个人佩挂胸针戴着发夹，手中挥动着美国小国旗，向入伍战士欢呼。舅舅穿着军服，在军乐队伴奏下与他们一群刚入伍的青年一道登上了列车。这些刚入伍的新兵，谁都没有接受过训练，不过他们登上列车时穿上了军服。

source: The band played and the crowd cheered.
zh_cn: 军乐队为他们演奏乐曲，群众为他们欢呼。

source: Although no one noticed, I'm sure my grandmother had a tear in her eye for the only son, going off to war.
zh_cn: 可是谁也没注意到，但我可肯定地说，外婆因他唯一儿子上战场流了眼泪 。

source: The train groaned as if it knew the destiny to which it was taking its passengers, but it soon it began to move.
zh_cn: 列车发出的汽笛呻吟声似乎知道车上乘客的命运。不久，列车开始启动后徐徐离开了车站。

source: Still cheering and waving their flags, the band still playing, the train slowly departed the station.
zh_cn: 站台上人们仍挥舞着国旗欢呼，军乐队演奏乐曲。

source: It had gone about a thousand yards when it suddenly ground to a halt.
zh_cn: 大概走了一千码，列车突然停了下来。

source: The band stopped playing, the crowd stopped cheering.
zh_cn: 乐队停止了演奏，群众停止了欢呼。

source: Everyone gazed in wonder as the train slowly backed up and returned to the station.
zh_cn: 列车缓缓地往回倒车直到站台，所有人都十分惊奇地注视着。

source: It seemed an eternity until the doors opened and the men started to file out.
zh_cn: 经过长时间等待，列车打开了车门，战士陆续走下车来。

source: Someone shouted, "It's the armistice. The war is over."
zh_cn: 此时有人喊叫：“停战了，战争结束了。”

source: For a moment, nobody moved, but then the people heard someone bark orders at the soldiers.
zh_cn: 所有人都站在原处不动，只听见有人向战士下达命令。

source: The men lined up formed into two lines, walked down the steps and, with the band in tow, playing a Sousa march, paraded down the street, as returning heroes, to be welcomed home by the assembled throng.
zh_cn: 战士们排成了二行走了出来，乐队在队伍后面演奏着“苏萨进行曲（Sousa march）”。他们昂首阔步行进在大街上，宛如英雄归来，受到大批群众热烈欢迎。

source: As soon as the parade ended they were, immediately, mustered out of the army.
zh_cn: 游行一结束，战士们就接着退伍。

source: My mother said it was a great day, but she was just a little disappointed that it didn't last a tiny bit longer.
zh_cn: 我妈妈说这是重大日子，不过她对如此短暂时间有点失望。

source: The next day my uncle returned to his job, and my grandfather resumed reading the German newspaper, which he read until the day he died.
zh_cn: 第二天舅舅就返回工作岗位，我外公重新开始看他的德语报，直到临终。
